const Mock = require('mockjs')

const chartData = [
  {
    子公司: '咪咕+',
    FK001: 310504,
    FK002: 552339,
    FK003: 259034,
    FK0010: 450818,
    FK004: 1231572,
    FK005: 1215966,
    FK006: 641667,
  },
  {
    子公司: '咪咕音乐',
    FK001: 52083,
    FK002: 85640,
    FK003: 42153,
    FK0010: 74257,
    FK004: 198724,
    FK005: 183159,
    FK006: 50277,
  },
  { 子公司: '咪咕数媒', FK001: 515910, FK002: 828669, FK003: 362642 },
  {
    子公司: '咪咕互娱',
    FK001: 202070,
    FK002: 343207,
    FK003: 157204,
    FK0010: 264160,
    FK004: 754420,
    FK005: 727124,
    FK006: 407205,
  },
  {
    子公司: '咪咕动漫',
    FK001: 2704659,
    FK002: 4499890,
    FK003: 2159981,
    FK0010: 3853788,
    FK004: 10604510,
    FK005: 8819342,
    FK006: 4114496,
  },
  {
    子公司: '咪咕视讯',
    FK001: 211637,
    FK002: 403658,
    FK003: 196918,
    FK0010: 325110,
    FK004: 916955,
    FK005: 968967,
    FK006: 478007,
  },
]
module.exports = {
  'POST /day': function (req, res) {
    setTimeout(() => {
      res.json({
        data: chartData,
        code: 0,
        msg: 'query success',
      })
    }, 4000)
  },
}
